cmsis-svd/cmsis-svd/data/Microchip/ATSAMD21ExB.svd
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SERCTRL%s</name>
          <description>Serializer n Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SERMODE</name>
              <description>Serializer Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SERMODESelect</name>
                <enumeratedValue>
                  <name>RX</name>
                  <description>Receive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Transmit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM2</name>
                  <description>Receive one PDM data on each serial clock edge</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDEFAULT</name>
              <description>Line Default Line when Slot Disabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TXDEFAULTSelect</name>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Output Default Value is 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Output Default Value is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIZ</name>
                  <description>Output Default Value is high impedance</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSAME</name>
              <description>Transmit Data when Underrun</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXSAMESelect</name>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Zero data transmitted in case of underrun</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAME</name>
                  <description>Last data transmitted in case of underrun</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Clock Unit Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CLKSELSelect</name>
                <enumeratedValue>
                  <name>CLK0</name>
                  <description>Use Clock Unit 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>Use Clock Unit 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLOTADJ</name>
              <description>Data Slot Formatting Adjust</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SLOTADJSelect</name>
                <enumeratedValue>
                  <name>RIGHT</name>
                  <description>Data is right adjusted in slot</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT</name>
                  <description>Data is left adjusted in slot</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATASIZE</name>
              <description>Data Word Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>DATASIZESelect</name>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>24 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>20 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>18 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 bits</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16C</name>
                  <description>16 bits compact stereo</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 bits</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8C</name>
                  <description>8 bits compact stereo</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WORDADJ</name>
              <description>Data Word Formatting Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WORDADJSelect</name>
                <enumeratedValue>
                  <name>RIGHT</name>
                  <description>Data is right adjusted in word</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT</name>
                  <description>Data is left adjusted in word</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTEND</name>
              <description>Data Formatting Bit Extension</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EXTENDSelect</name>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Extend with zeroes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Extend with ones</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSBIT</name>
                  <description>Extend with Most Significant Bit</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSBIT</name>
                  <description>Extend with Least Significant Bit</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BITREV</name>
              <description>Data Formatting Bit Reverse</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BITREVSelect</name>
                <enumeratedValue>
                  <name>MSBIT</name>
                  <description>Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSBIT</name>
                  <description>Transfer Data Least Significant Bit (LSB) first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLOTDIS0</name>
              <description>Slot 0 Disabled for this Serializer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLOTDIS1</name>
              <description>Slot 1 Disabled for this Serializer</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLOTDIS2</name>
              <description>Slot 2 Disabled for this Serializer</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLOTDIS3</name>
              <description>Slot 3 Disabled for this Serializer</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLOTDIS4</name>
              <description>Slot 4 Disabled for this Serializer</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLOTDIS5</name>
              <description>Slot 5 Disabled for this Serializer</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLOTDIS6</name>
              <description>Slot 6 Disabled for this Serializer</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLOTDIS7</name>
              <description>Slot 7 Disabled for this Serializer</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MONO</name>
              <description>Mono Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MONOSelect</name>
                <enumeratedValue>
                  <name>STEREO</name>
                  <description>Normal mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONO</name>
                  <description>Left channel data is duplicated to right channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA</name>
              <description>Single or Multiple DMA Channels</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DMASelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single DMA channel</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPLE</name>
                  <description>One DMA channel per data channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXLOOP</name>
              <description>Loop-back Test Mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DATA%s</name>
          <description>Data n</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Sample Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
